#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>

//数组

//1. 一维数组的创建和初始化。
//1.1 数组的创建
//数组是一组相同类型元素的集合。
//数组的创建方式：

//int main()
//{
//	//int a = 1;
//	//int b = 2;
//	//1~10
//	//数组 - 一组相同类型元素的集合。
//	int arr[10];
//	char ch[5];
//	double data1[20];
//	double data2[15+5];
//
//	//下面的代码只能在支持C99标准的编译器上编译
//	int n = 10;
//	scanf("%d", &n);
//	int arr2[n];//这种数组是不能初始化的
//	//在C99标准之前，数组的大小必须是常量或者常量表达式
//	//在C99之后，数组的大小可以是变量，为了支持变长数组
//
//	return 0;
//}

//1.2 数组的初始化
//数组的初始化是指，在创建数组的同时给数组的内容一些合理初始值（初始化）。
//int main()
//{
//	//不完全初始化,剩余的元素默认初始化为0
//	int arr[10] = { 1,2,3 };
//	//完全初始化
//	int arr1[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int arr2[] = { 1,2,3 };
//
//	char ch1[10] = { 'a','b','c' };
//	//a b c 0 0 0 0 0 0 0
//	char ch2[10] = "abc";
//	//a b c \0 0 0 0 0 0 0
//	char ch3[] = { 'a','b','c' };
//	char ch4[] = "abc";
//
//	return 0;
//}

//1.3 一维数组的使用
//对于数组的使用我们之前介绍了一个操作符:[]，下标引用操作符。它其实就数组访问的操作符。
//1' 数组是使用下标来访问的，下标是从0开始。
//2' 数组的大小可以通过计算得到。

//int main()
//{
//	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//	//            0 1               9
//	//[] - 下标引用操作符
//	//printf("%d\n", arr[4]);
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);//10
//	/*for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}*/
//	for (i = sz - 1; i >= 0; i--)
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}

//1.4 一维数组在内存中的存储
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//	int i = 0;
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (i = 0; i < sz; i++)
//	{
//		printf("&arr[%d] = %p\n", i, &arr[i]);//数组在内存中是连续存放的。
//	}
//
//	return 0;
//}

//2. 二维数组的创建和初始化
//二维数组可以理解为：一维数组的数组
//2.1 二维数组的创建
//2.2 二维数组的初始化
//2.3 二维数组的使用
//2.4 二维数组在内存中的存储
//1 2 3 4
//2 3 4 5
//3 4 5 6

//int main()
//{
	////完全初始化
	//int arr[3][4] = { 1,2,3,4,2,3,4,5,3,4,5,6 };//3行4列
	////不完全初始化
	//int arr1[3][4] = {1,2,3,4,2,3,4,5,3,4};
	//int arr2[3][4] = { {1,2},{2,3},{3,4} };//进行一定的分组

	//int arr3[][4] = { {1,2,3,4},{2,3} };//二维数组如果有初始化，行可以省略，列不能省略

	////char arr2[5][10];


	//int arr[3][4] = { 1,2,3,4,2,3,4,5,3,4,5,6 };
	//int i = 0;

	//for (i = 0; i < 3; i++)
	//{
	//	int j = 0;
	//	for (j = 0; j < 4; j++)
	//	{
	//		scanf("%d", &arr[i][j]);
	//	}
	//}

	//for (i = 0; i < 3; i++)
	//{
	//	int j = 0;
	//	for (j = 0; j < 4; j++)
	//	{
	//		printf("%d ", arr[i][j]);
	//	}
	//	printf("\n");
	//}


//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 4; j++)
//		{
//			printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);//二维数组在内存中也是连续存储的
//		}
//	}
//
//	return 0;
//}

//3. 数组越界
//数组的下标是有范围限制的。
//数组的下规定是从0开始的，如果数组有n个元素，最后一个元素的下标就是n - 1。
//所以数组的下标如果小于0，或者大于n - 1，就是数组越界访问了，超出了数组合法空间的访问。
//C语言本身是不做数组下标的越界检查，编译器也不一定报错，但是编译器不报错，并不意味着程序就是正确的，
//所以程序员写代码时，最好自己做越界

//一维数组越界
//错误示范
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6 };//0~5
//	int i = 0;	
//	//int sz = sizeof(arr) / sizeof(arr[0]);

//	//0~9
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}

//二维数组越界
//错误示范
//int main()
//{
//	int arr[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	int i = 0;
//	for (i = 0; i < 3; i++)
//	{
//		int j = 0;
//		for (j = 0; j < 5; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}

//4. 数组作为函数参数
//4.1 冒泡排序函数的错误设计及正确设计
//冒泡排序的核心思想：两个相邻的元素进行比较
//一趟冒泡排序让一个数据来到它最终应该出现的位置上

//数组传参的时候，形参有2种写法：
//1. 数组
//2. 指针

//形参是指针的形式
//void bubble_sort(int* arr, int sz)

//形参是数组的形式
//void bubble_sort(int arr[], int sz)//地址是应该使用指针来接收，所以arr这里看似是数组，本质是指针变量
//{
//	//趟数
//	//int sz = sizeof(arr) / sizeof(arr[0]);//错误设计
//
//	int i = 0;
//	for (i = 0; i < sz - 1; i++)
//	{
//		//一趟冒泡排序
//		int j = 0;
//		for (j = 0; j < sz - 1 - i; j++)
//		{
//			if (arr[j] > arr[j + 1])
//			{
//				//交换
//				int tmp = arr[j];
//				arr[j] = arr[j + 1];
//				arr[j + 1] = tmp;
//			}
//		}
//	}
//}
//
//int main()
//{
//	//数组
//	//把数组的数据排成升序
//	int arr[] = { 9,8,7,6,5,4,3,2,1,0 };
//	//0 1 2 3 4 5 6 7 8 9
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	
//	//冒泡排序的算法，对数组进行排序
//	bubble_sort(arr, sz);//数组名本质上是：数组首元素的地址
//	int i = 0;
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}

//4.2 数组名是什么？
//数组名确实能表示首元素的地址
//但是有2个例外：
//1. sizeof(数组名)，这里的数组名表示整个数组，计算的是整个数组的大小，单位是字节
//2. &数组名，这里的数组名表示整个数组，取出的是整个数组的地址

//一维数组的数组名的理解
//int main()
//{
//	int arr[10] = { 0 };
//	printf("%p\n", arr);//arr就是首元素的地址
//	printf("%p\n", arr + 1);
//	printf("----------------------\n");
//	printf("%p\n", &arr[0]);//首元素的地址
//	printf("%p\n", &arr[0] + 1);
//	printf("----------------------\n");
//	printf("%p\n", &arr);//数组的地址
//	printf("%p\n", &arr + 1);
//
//	//int n = sizeof(arr);//40
//	//printf("%d\n", n);
//	//输出结果
//	return 0;
//}

//二维数组的数组名的理解
int main()
{
	int arr[3][4] = { 0 };
	//例外1：sizeof(数组名)
	//int sz = sizeof(arr);
	//printf("%d\n", sz);

	//例外2：&数组名
	//printf("%p\n", &arr);//数组的地址
	//printf("%p\n", &arr + 1);


	//printf("%p\n", arr);//二维数组的数组名也表示首元素的地址 - 二维数组首元素的地址表示第0行整行元素的地址
	//printf("%p\n", arr + 1);

	//求二维数组有几行
	printf("%d\n", sizeof(arr) / sizeof(arr[0]));
	//求二维数组有几列
	printf("%d\n", sizeof(arr[0]) / sizeof(arr[0][0]));
	
	return 0;
}




